[
    {
        "code":"technical-facilitator",
        "title": "Instructor / Technical Facilitator",
        "postTime":"2023-12-22T11:21:46.853Z",
        "postedSince": "",
        "deadline": "2024-01-03T12:00:00.853Z",
        "location": "On site, Kigali, Kacyiru",
        "worktime":"Full-Time",
        "summaryOfResponsibilities":"",
        "organizationSummary": "SheCanCode is an exceptional in-person coding Bootcamp that was launched by Igire Rwanda Organization (IR0) in 2017, in collaboration with the USA Embassy in Kigali. Its main objective is to bridge the digital skills gap between men and women by inspiring more young women to join and remain in the tech industry. The program trains young women and girls in Rwanda to become software developers in just 16 weeks. Upon completion of the training, the finalists are provided with career services to help them find fulfilling job opportunities.",
        "aboutTheJob": "Do you have the skills and competencies to facilitate others to transition their careers in the technology industry? Igire Rwanda Organization is hiring a Mobile application facilitator. \n\nIn this role, you will facilitate and inspire young women who are attending the SheCanCODE bootcamp by daily investing in the next generation of African leaders to gain skills and competencies to become employable software developers globally.",
        "rolesAndResponsibilities": {
            "introduction":"",
            "list":[
                "Develop and facilitate courses in mobile software development to prepare students for entry-level positions leading to careers in the mobile development field.",
                "Developing and designing Mobile Engineering program curriculum and materials.",
                "Develop and teach the full range of classes including but not limited to HTML, CSS, JAVASCRIPT, PRODUCT DESIGN AND DEVELOPMENT, React Native Library",
                "Maintain a clean and well-organized classroom",
                "Develop and communicate classroom norms and standards for students, and support staff to ensure high-quality training.",
                "Work with students' success office and coaches to place students in software development positions",
                "Collaborate with business and industry partners",
                "Participate in the scheduling of training for programs",
                "Develop and work with advisory members to hold regular meetings",
                "Drive creative solutions that improve the standard of our software products and learning programs",
                "Deliver actionable feedback and support multiple learners to grow significantly",
                "Support the learning and professional development of students attending SheCanCODE."    
            ]
        },
        "otherResponsibilities":{
            "introduction":"",
            "list": [
                "Taking ownership of the organization's vision and helping to innovate and grow",
                "Collaboratively and passionately deliver excellent work with integrity every day",
                "Continuously level up your skills and grow with the organization"
            ]
        },
        "experience": {
            "introduction":"The ideal candidate for the role MUST have experience with the following:",
            "list":[
                "Minimum 2 years working experience (or equivalent experience with multiple professional software development product teams) in Full-stack Software Development: JS (Node/Angular/Meteor/React/ReactNative), Javascript, Mobile Development (Android/iOS)",
                "Experience with Agile Software Development Techniques and Tools such as: SCRUM, Trello/Pivotal, Version Control (Github/Bitbucket), TDD, Continuous Integration, Docker/Vagrant, Leading teams to build and deploy Professional Software Products, Relational/Business/People/Soft Skills experience, Demonstrable commitment to the learning & development of people and technology, The ability to learn new things fast whilst delivering value on it simultaneously."
            ]
        },
        "preferredSkills": [],
        "otherQualities": [
            "Curriculum design",
            "Have experience in designing a workshop, bootcamps, developer forums, and Teck meetups. ",
            "Experience in mentorship and coaching software developers ",
            "Have experience in facilitating coding bootcamps.",
            "Program development"
        ]
    },
    {
        "code":"program-manager-and-m&e",
        "title": "Program Manager and M&E",
        "postTime":"2023-12-27T05:30:46.853Z",
        "postedSince": "",
        "deadline": "2024-01-03T12:00:00.853Z",
        "location": "On site, Kigali, Kacyiru",
        "worktime":"Full-Time (Consultant Position)",
        "summaryOfResponsibilities":"Oversees the projects of Igire Rwanda Organization and supports the organization in achieving its goals and mission and reports to Project Director.",
        "organizationSummary": "",
        "aboutTheJob": "The Program Manager provides leadership for developing, managing, and delivering the projects, with support from other Igire Rwanda Organization(IRO) team members and other community partners with experience, capacity, knowledge, and relationships to add to the range of resources and support available through IRO. The Manager is a member of the Leadership team, where they will oversee the projects and ensure the success, and other activities in support of IRO’s mission.",
        "rolesAndResponsibilities": {
            "introduction":"Program manager (60%) and M&E(40%)",
            "list":[
                "Oversee the entire lifecycle of the organization's projects while keeping all the projects on track.",
                "Work closely with the project director, and cross-functional teams to develop the scope, deliverables, required resources, work plan, budget, and timing for new initiatives.",
                "Develop and manage budget for projects and be accountable for delivering against established business goals/objectives",
                "Work with other program managers to identify risks and opportunities across multiple projects within the department",
                "Analyze, evaluate, and overcome program risks, and produce program reports for managers and stakeholders",
                "Oversee administrative aspects of programs to meet the objectives of the stakeholders",
                "Analyze data to determine the effectiveness of programs.",
                "Suggest and implement improvements to programs and services",
                "Plan and manage outreach activities for increased awareness of programs/organization",
                "Collaborate with grant officer to write proposals for project funding",
                "Strategize, implement and maintain projects that adhere to the organization's mission",
                "Develop program assessment protocols for evaluation, implementation, and reporting.",
                "Maintain organizational standards of satisfaction, quality, and performance",
                "Oversee multiple project teams, ensuring program goals are reached",
                "Manage budget and funding channels for maximum productivity"
            ]
        },
        "otherResponsibilities":{
            "introduction":"",
            "list": []
        },
        "experience": {
            "introduction":"The ideal candidate for the role MUST have experience with the following:",
            "list":[
                "3-2 years of experience in an upper-management role, preferably in program management",
                "Exceptional skills in leadership, time management, facilitation, and organization",
                "Experience in managing stakeholders",
                "Working knowledge of digital marketing",
                "Outstanding knowledge of change management principles and performance evaluation processes",
                "Ability to perform data analysis, converting raw findings into measurable outcomes to drive progress.",
                "Written and verbal communication skills paired with strong critical thinking to help solve barriers to execution.",
                "Strong relationship management skills, collaborating across many divisions to ensure the vision is achieved.",
                "Project management, helping to oversee the entire lifecycle of a project while keeping all stakeholders on task."
            ]
        },
        "otherQualities": [],
        "preferredSkills": {
            "introduction":"",
            "list": [
                "Bachelor’s degree (or equivalent) in business administration or related field",
                "Strong working knowledge of Project management tools (Asana)",
                "Experience in proposal writing"
            ]
        }
    },
    {
        "code":"grant-officer-and-communication-officer",
        "title": "Grant officer and communications officer",
        "postTime":"2023-12-27T05:30:46.853Z",
        "postedSince": "",
        "deadline": "2024-01-03T12:00:00.853Z",
        "location": "On site, Kigali, Kacyiru",
        "worktime":"Full-Time (Consultant Position)",
        "summaryOfResponsibilities":"Identifying prospects and writing applications to secure financial support for Igire Rwanda Organization and support the organization in achieving its goals and mission, reporting to Program Manager.",
        "organizationSummary": "",
        "aboutTheJob": "",
        "rolesAndResponsibilities": {
            "introduction":"Grant Writer (60%) and Communications (40%)",
            "list":[
                "Researches and identifies new government, corporate, foundation, and private funding prospects to match organization goals;",
                "Generates high-quality proposals, narratives, applications, and supporting documents in response to solicitations consistent with all policies and procedures of Igire Rwanda Organization, and the requirements and funding partners;",
                "Maintains primary responsibility for grant schedules and tracking grants;",
                "Serves as a liaison to all funding agencies and organizations;",
                "Works with appropriate personnel to research, develop, write, and submit letters of inquiry, concept papers, and grant proposals;",
                "Coordinates and follows up on the progress of submitted proposals; ",
                "Coordinates with the finance officer to create expenditure and income budgets to accompany proposals;",
                "Develops and maintains a master file on pending grants and contracts;",
                "Remains up-to-date on current issues relative to grant proposals;",
                "Meets regularly with the leadership team to discuss current and new funding needs;",
                "Inform staff and answer questions regarding the allowability of proposed expenditures related to all specific grants;",
                "Inform the supervisor of the progress of all grants and issues that may arise with each grant.",
                "Requires the kind of teamwork, supervision, and personal interaction that cannot be had in a home office situation; therefore, regular and predictable on-site attendance is a job requirement",
                "Developing and leading a social media strategy for the organization",
                "Owning a social media roadmap and maintaining a daily social media calendar",
                "Collaborating with the IRO team to brainstorm ideas to increase awareness of the organization's programs on social media",
                "Developing content that connects the organization with audiences"                
            ]
        },
        "otherResponsibilities":{
            "introduction":"",
            "list": []
        },
        "experience": {
            "introduction":"The ideal candidate for the role MUST have experience with the following:",
            "list":[
                "Bachelor’s degree required",
                "Grant writing experience",
                "Experience which should demonstrate a proven track record of securing new funding opportunities; comprehensive knowledge of research, and the ability to distinguish and identify opportunities for nonprofit organizations.",
                "Ability to work effectively under pressure",
                "Excellent writing and verbal skills",
                "Be highly organized with the ability to implement systems and follow-up processes",
                "Proficiency in research, interpreting, and analyzing diverse data",
                "Excellent Computer skills (Microsoft Office Word, Access, PowerPoint, and Excel), and database management skills",
                "Motivated self-starter with the ability to work collaboratively and independently with purpose and accuracy in a fast-paced environment."
            ]
        },
        "otherQualities": [],
        "preferredSkills": {
            "introduction":"",
            "list": [
                "Bachelor’s degree",
                "2-3 years of experience as a successful grant writer",
                "Previous grant budget development and management",
                "A proven record of securing major grants with certifiable references"
            ]
        }
    }
]