[
    {
        "code": "social-media-management-and-marketing-intern",
        "title": "Social Media Management and Marketing Intern",
        "postTime": "2024-02-19T16:20:46.641Z",
        "postedSince": "",
        "deadline": "2024-03-01T23:59:00.641Z",
        "location": "On site, Kigali, Kacyiru",
        "worktime": "Full-Time",
        "summaryOfResponsibilities": "📢 Join Our Team as a Social Media Manager and Marketing Intern at Igire Rwanda Organization!",
        "organizationSummary": "",
        "aboutTheJob": "Are you passionate about making a difference in your community? Do you have a knack for social media and marketing? Igire Rwanda Organization is seeking a motivated and creative individual to join our team as a social media manager and Marketing Intern. This is an exciting opportunity to gain hands-on experience in strategic marketing while contributing to meaningful projects that positively impact Rwanda. ",
        "rolesAndResponsibilities": {
            "introduction": "",
            "list": [
                "Strategic Planning: Develop and implement comprehensive marketing strategies to promote our organization's initiatives and events.",
                "Campaign Management: Plan, execute, and monitor marketing campaigns across various channels, including digital, social media, and traditional platforms.",
                "Digital Marketing: Manage and optimize digital marketing channels, such as social media, email marketing, and online advertising, to maximize outreach and engagement.",
                "Content Creation: Develop engaging and relevant content for various marketing channels daily, ensuring consistent messaging and branding.",
                "Market Research: Conduct market research to identify new opportunities and preferences, informing future marketing strategies.",
                "Brand Management: Contribute to the development and maintenance of our brand identity, ensuring consistency in messaging and branding across all marketing materials.",
                "Reporting: Share frequent reports on deliverables, including campaign performance metrics and audience engagement insights."
            ]
        },
        "otherResponsibilities": {
            "introduction": "",
            "list": []
        },
        "experience": {
            "introduction": "The ideal candidate for the role MUST have experience with the following:",
            "list": [
                "Proficiency in digital marketing tools and platforms, such as social media management software and email marketing platforms.",
                "Familiarity with marketing analytics and reporting tools to track and measure campaign effectiveness.",
                "Graphic design skills and knowledge of design software (e.g., Adobe Creative Suite) is a plus, but not required."
            ]
        },
        "otherQualities": [],
        "preferredSkills": {
            "introduction": "",
            "list": [
                "Enrolled in or recently graduated from any university. ",
                "Strong communication and organizational skills.",
                "Ability to work independently and collaboratively in a fast-paced environment.",
                "Passion for social impact and community development in Rwanda."
            ]
        },
        "benefits": {
            "introduction": "",
            "list": [
                "Hands-on experience in strategic marketing and social media management.",
                "Opportunity to make a meaningful impact in the Rwandan community.",
                "Mentorship and professional development opportunities. "
            ]
        },
        "applicationRequirements": "If you're ready to take the next step in your marketing career and make a difference with Igire Rwanda Organization, apply now by sending your resume and cover letter to education@igirerwanda.org  Join us in our mission to create positive change through innovative marketing strategies!"
    }
]